//*****************************************************************************
//
//! \file always.h
//!
//! \brief 编译器宏定义相关
//!
//! \details
//!
//! \author 李博克
//!
//! \date 2024-09-14
//!
//! \version V1.1
//!
//! \copyright 北京三鼎光电仪器有限公司。
//
//*****************************************************************************

//*****************************************************************************
// includes
//*****************************************************************************

#ifndef SRC_ALWAYS_H_
#define SRC_ALWAYS_H_

#define ALWAYSINLINE   __attribute__((always_inline))
#define __UNUSED        __attribute__((unused))


#endif /* SRC_ALWAYS_H_ */
